# """
# A = X + x1 + ... + Xn
# B = X - x1 - ... - Xn
# Определить соответствие заданных параметров данным последовательностям.
# """
# A, B, n = map(int,input().split())
# if (A > B) & ((A + B) % 2 == 0) & ((A + B) / 2 >= n):
#     print('YES')
# else:
#     print('NO')

# """
# Определить количество отдельных максимально больших квадратов в заданном прямоугольнике.
# """
# n, m = map(int, input().split())
# i = []
# while n != m:
#     i.append([min(n, m), abs(n - m)])
#     n = int(i[-1][0])
#     m = int(i[-1][1])
# print(len(i) + 1)
#
"""
Определить максимальное количество вариантов попадания коня из нижней левой в верхнюю правую клетку шахматной доски заданной площади.
Конь ходит либо вверх-вверх-вправо, либо вправо-вправо-вверх.
"""
n, m = map(int, input().split())
chess_d = [[0] * 50 for i in range(50)]
chess_d[1][2] = 1
chess_d[2][1] = 1
x = 3
while (x < 50):
    for i in range(x+1):
        chess_d[x][i] = chess_d[x - 1][i - 2] + chess_d[x - 2][i - 1]
        if chess_d[x][i] !=0:
            y = chess_d[x][i]
            chess_d[i][x] = y
    x += 1
print(chess_d[n-1][m-1])


